W6D3/RoutesAndControllers/frac2/app/controllers/artworks_controller.rb

  def index
    artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "MOREART!MOREART!"], ["updated_at", "2021-12-03 00:40:47.853030"], ["id", 1]]

  def destroy
    artwork = Artwork.find(params[:id]).delete
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]