W6D3/RoutesAndControllers/frac2/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Charlie"], ["updated_at", "2021-12-03 00:09:24.623957"], ["id", 9]]
---
  def update
    user = User.find(params[:id])
    redirect_to user_url if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    User.find(params[:id]).delete