W7D5/redditClone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "o4JEO4wmtGykRgp9a6J4Ew"], ["LIMIT", 1]]
---
  def current_user
    @current_user = User.find_by(session_token: session[:session_token])