W7D5/redditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:id])

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "It works"], ["description", "NICE"], ["moderator_id", 2], ["created_at", "2021-12-11 00:10:07.051060"], ["updated_at", "2021-12-11 00:10:07.051060"]]
---
  def create
    @sub = Sub.new(sub_params)
    if @sub.save